# Detector: Faster R-CNN
# Backbone CNN: Resnet-101 (v1)
# Dataset MS COCO 2017 train / 2017 val
# Baseline

model {
  faster_rcnn {
    num_classes: 90
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 600
        max_dimension: 1024
      }
    }
    feature_extractor {
      trainable: true
      type: 'faster_rcnn_resnet101'
      first_stage_features_stride: 16
      weight_decay:0.0001
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0]
        aspect_ratios: [0.5, 1.0, 2.0]
        height_stride: 16
        width_stride: 16
      }
    }
    first_stage_box_predictor_trainable: true
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0001
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_batch_size: 256
    second_stage_box_predictor {
      trainable: true
      mask_rcnn_box_predictor {
        spatial_average: true
        use_dropout: false
        dropout_keep_probability: 1.0
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0001
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 300
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}

train_config: {
  batch_size: 3
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: .001
          schedule {
            step: 820000
            learning_rate: .0001
          }
          schedule {
            step: 900000
            learning_rate: .00001
          }
          schedule {
            step: 15000000
            learning_rate: .000001
          }
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "../checkpoints/detection_model_zoo/resnet_v1_101.ckpt"
  from_detection_checkpoint: false
  restore_box_predictor: false
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  save_interval_secs: 600
  save_summaries_secs: 120
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "../data/mscoco/coco_2017_train.record"
  }
  label_map_path: "../data/mscoco_label_map.pbtxt"
}

eval_config: {
  submission_format_output: false
  metrics_set: "coco_metrics"
  calc_loss: false
  num_visualizations: 10
  num_examples: 50000
  eval_interval_secs: 120
  nms_threshold: 1.0

  coco_eval_options: {
    # 0(AP), 1(AP_IoU50), 2(AP_IoU75), 3(AP_small), 4(AP_medium), 5(AP_large),
    # 6(AR_max1), 7(AR_max10), 8(AR_max100), 9(AR_small), 10(AR_medium), 11(AR_large)
    eval_metric_index: [0,1,2,3,4,5,6,7,8,9,10,11]
    # 0: All, 1: All+classwise
    eval_class_type: 0
#    eval_ann_filename: "../data/mscoco/annotations/image_info_test-dev2017.json"
    eval_ann_filename: "../data/mscoco/annotations/instances_val2017.json"
  }
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "../data/mscoco/coco_2017_val.record"
  }
  label_map_path: "../data/mscoco_label_map.pbtxt"
  shuffle: false
  num_readers: 1
}